# HYPERPARAMETER TUNING

In [38]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [39]:
data = pd.read_csv(r'C:\Users\User\juypter\files\Salary_Data.csv')
data.head()

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
0,32.0,Male,Bachelor's,Software Engineer,5.0,90000.0
1,28.0,Female,Master's,Data Analyst,3.0,65000.0
2,45.0,Male,PhD,Senior Manager,15.0,150000.0
3,36.0,Female,Bachelor's,Sales Associate,7.0,60000.0
4,52.0,Male,Master's,Director,20.0,200000.0

In [40]:
c = data.drop(columns=["Age", "Gender", "Education Level", "Job Title"])
c

      Years of Experience    Salary
0                     5.0   90000.0
1                     3.0   65000.0
2                    15.0  150000.0
3                     7.0   60000.0
4                    20.0  200000.0
...                   ...       ...
6699                 20.0  200000.0
6700                  3.0   50000.0
6701                  4.0   55000.0
6702                 14.0  140000.0
6703                  1.0   35000.0

[6704 rows x 2 columns]

In [41]:
c.isnull().sum() #check for null values

Years of Experience    3
Salary                 5
dtype: int64

In [42]:
c.dropna()

      Years of Experience    Salary
0                     5.0   90000.0
1                     3.0   65000.0
2                    15.0  150000.0
3                     7.0   60000.0
4                    20.0  200000.0
...                   ...       ...
6699                 20.0  200000.0
6700                  3.0   50000.0
6701                  4.0   55000.0
6702                 14.0  140000.0
6703                  1.0   35000.0

[6699 rows x 2 columns]

In [43]:
c.isnull().sum()

Years of Experience    3
Salary                 5
dtype: int64

In [44]:
x = c.fillna(method='ffill')

C:\Users\User\AppData\Local\Temp\ipykernel_14928\409793465.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  x = c.fillna(method='ffill')

In [45]:
x.isnull().sum()

Years of Experience    0
Salary                 0
dtype: int64

In [46]:
x = c.iloc[:,:-1]
x.ndim
y =["Salary"]

In [ ]:
from sklearn.model_selection import train_test_split

x_train,x_test,y_train,y_test = train_test_split(x,y,test_size=0.2,random_state=42)

In [ ]:
from sklearn.tree import DecisionTreeRegressor
from sympy.abc import y

dt = DecisionTreeRegressor()
dt.fit(X_train,y_train)

In [ ]:
dt.dcore(x_train,y_train)*100,dt.dcore(x_test,y_test)*100

In [ ]:
df = {criterion=["squared_error","friedman_mse","absolute_error","poisson"],spliter =["best","random"],max_depth=}

In [ ]:
from sklearn.model_selection import GridSearchCV,RandomizedSearchCV